# 1. Квадрат числа. 
# Користувач вводить число. Програма виводить його квадрат.
# Приклад:
# Введіть число: 5
# Квадрат числа: 25

# num = int(input('Введите число: '))
# print(f'Квадрат числа: {num * num}')

# 2. “Середнє трьох чисел”
# Програма запитує три числа і виводить їх середнє арифметичне.
# Приклад:
# Введіть три числа: 2, 4, 6
# Середнє: 4.0

# n1, n2, n3 = int(input('Введите первое число: ')), int(input('Введите второе число: ')), int(input('Введите третье число: '))
# result = (n1 + n2 + n3) / 3
# print(result)

# 3. “Перетворення хвилин у години”
# Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.
# Приклад: 
# Введіть кількість хвилин: 135
# 2 години 15 хвилин

# minutes = int(input('Введите количество минут: '))
# print(f'{minutes // 60} часа {minutes % 60} минут')

# 4. “Розрахунок знижки”
# Користувач вводить ціну товару і розмір знижки у %.
# Програма виводить кінцеву ціну.
# Приклад:
# Введіть ціну: 1000
# Введіть знижку (%): 15
# Ціна зі знижкою: 850.0

# cena = int(input('Введите цену: '))
# discount = int(input('Введите скидку (%): '))
# result = cena - (cena * (discount / 100))
# print(f'Цена со скидкой: {result}')

# 5. “Остання цифра числа”
# Користувач вводить ціле число, програма виводить його останню цифру.
# Приклад:
# Введіть число: 347
# Остання цифра: 7

# num = int(input('Введите число: '))
# print(f'Последняя цифра: {num % 10}')

# 6. “Периметр прямокутника”
# Користувач вводить довжину і ширину. Програма виводить периметр.
# Приклад:
# Введіть довжину: 5
# Введіть ширину: 3
# Периметр: 16

# length = int(input('Введите длину: '))
# width = int(input('Введите ширину: '))
# print(f'Периметр: {2 * (length + width)}')

# 7. Виведення числа в стовпчик
# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик цифр, з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
# 1
# 2
# 3
# 4

# num = int(input('Введите четырехзначное число: '))
# d1 = (num // 1000) % 10
# d2 = (num // 100) % 10
# d3 = (num // 10) % 10
# d4 = num % 10
# print(d1, d2, d3, d4, sep = '\n')