# # Модифікувати калькулятор таким чином, щоб він працював доти, доки користувач цього хоче. 
# # Тобто, потрібно робити запит до користувача на продовження роботи калькулятора після 
# # кожного обчислення - якщо користувач ввів yes (можна просто y), то нове обчислення, 
# # інакше - закінчення роботи.

# while True:
#     num1 = int(input('Введите первое число: '))
#     num2 = int(input('Введие второе число: '))
#     operator = input('Введите операцию: ')

#     match operator:
#         case '+':
#             print(f'Сумма чисел {num1} и {num2} = {num1 + num2}')
#         case '-':
#             print(f'Разость чисел {num1} и {num2} = {num1 - num2}')
#         case '*':
#             print(f'Произведение чисел {num1} и {num2} = {num1 * num2}')
#         case '/':
#             if num2 == 0:
#                 print('Деление на 0 невозможно')
#             else:
#                 print(f'Частное от {num1} к {num2} = {num1 / num2}')
#         case '**':
#             print(f'{num1} в степени {num2} = {num1 ** num2}')
#         case _:
#             print('Неверная операция')

#     user_input = input('Хотите продолжить работу калькулятора?: ')
    
#     if user_input == 'yes' or user_input == 'y':
#         continue
#     else:
#         break
