# Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
# Ну і додатковим завданням є турбота про виведення.
# Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні 
# заповнюватися нулями при одноцифрових значеннях.

# sec = int(input('Введите количество секунд (0 - 8640000): '))

# if 0 <= sec < 8640000:
#     days = sec // 86400
#     hours = (sec % 86400) // 3600
#     minutes = (sec % 3600) // 60
#     seconds = sec % 60
#     print(f'{days} дней, {hours:02}:{minutes:02}:{seconds:02}')
# else:
#     print('Неверное количество секунд')

